perf/scenarios/heavy.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Reset
      duration: 20
      arrivalRate: 0
    - name: Ramp
      duration: 30
      arrivalRate: 0.5
      rampTo: 0.7
    - name: Plain
      duration: 60
      arrivalRate: 0.7
    

scenarios:
  - name: Heavy (/heavy)
    flow:
      - get:
          url: '/heavy'